GopalSaraf/Practicals/PSDL/include/proc/pic18f6393.inc
// Register: LCDSE3
#define LCDSE3 LCDSE3
LCDSE3                                   equ 0F5Dh
// bitfield definitions
LCDSE3_LCDSE3_POSN                       equ 0000h
LCDSE3_LCDSE3_POSITION                   equ 0000h
LCDSE3_LCDSE3_SIZE                       equ 0008h
LCDSE3_LCDSE3_LENGTH                     equ 0008h
LCDSE3_LCDSE3_MASK                       equ 00FFh
LCDSE3_SE24_POSN                         equ 0000h
LCDSE3_SE24_POSITION                     equ 0000h
LCDSE3_SE24_SIZE                         equ 0001h
LCDSE3_SE24_LENGTH                       equ 0001h
LCDSE3_SE24_MASK                         equ 0001h
LCDSE3_SE25_POSN                         equ 0001h
LCDSE3_SE25_POSITION                     equ 0001h
LCDSE3_SE25_SIZE                         equ 0001h
LCDSE3_SE25_LENGTH                       equ 0001h
LCDSE3_SE25_MASK                         equ 0002h
LCDSE3_SE26_POSN                         equ 0002h
LCDSE3_SE26_POSITION                     equ 0002h
LCDSE3_SE26_SIZE                         equ 0001h
LCDSE3_SE26_LENGTH                       equ 0001h
LCDSE3_SE26_MASK                         equ 0004h
LCDSE3_SE27_POSN                         equ 0003h
LCDSE3_SE27_POSITION                     equ 0003h
LCDSE3_SE27_SIZE                         equ 0001h
LCDSE3_SE27_LENGTH                       equ 0001h
LCDSE3_SE27_MASK                         equ 0008h
LCDSE3_SE28_POSN                         equ 0004h
LCDSE3_SE28_POSITION                     equ 0004h
LCDSE3_SE28_SIZE                         equ 0001h
LCDSE3_SE28_LENGTH                       equ 0001h
LCDSE3_SE28_MASK                         equ 0010h
LCDSE3_SE29_POSN                         equ 0005h
LCDSE3_SE29_POSITION                     equ 0005h
LCDSE3_SE29_SIZE                         equ 0001h
LCDSE3_SE29_LENGTH                       equ 0001h
LCDSE3_SE29_MASK                         equ 0020h
LCDSE3_SE30_POSN                         equ 0006h
LCDSE3_SE30_POSITION                     equ 0006h
LCDSE3_SE30_SIZE                         equ 0001h
LCDSE3_SE30_LENGTH                       equ 0001h
LCDSE3_SE30_MASK                         equ 0040h
LCDSE3_SE31_POSN                         equ 0007h
LCDSE3_SE31_POSITION                     equ 0007h
LCDSE3_SE31_SIZE                         equ 0001h
LCDSE3_SE31_LENGTH                       equ 0001h
LCDSE3_SE31_MASK                         equ 0080h
LCDSE3_SEGEN24_POSN                      equ 0000h
LCDSE3_SEGEN24_POSITION                  equ 0000h
LCDSE3_SEGEN24_SIZE                      equ 0001h
LCDSE3_SEGEN24_LENGTH                    equ 0001h
LCDSE3_SEGEN24_MASK                      equ 0001h
LCDSE3_SEGEN25_POSN                      equ 0001h
LCDSE3_SEGEN25_POSITION                  equ 0001h
LCDSE3_SEGEN25_SIZE                      equ 0001h
LCDSE3_SEGEN25_LENGTH                    equ 0001h
LCDSE3_SEGEN25_MASK                      equ 0002h
LCDSE3_SEGEN26_POSN                      equ 0002h
LCDSE3_SEGEN26_POSITION                  equ 0002h
LCDSE3_SEGEN26_SIZE                      equ 0001h
LCDSE3_SEGEN26_LENGTH                    equ 0001h
LCDSE3_SEGEN26_MASK                      equ 0004h
LCDSE3_SEGEN27_POSN                      equ 0003h
LCDSE3_SEGEN27_POSITION                  equ 0003h
LCDSE3_SEGEN27_SIZE                      equ 0001h
LCDSE3_SEGEN27_LENGTH                    equ 0001h
LCDSE3_SEGEN27_MASK                      equ 0008h
LCDSE3_SEGEN28_POSN                      equ 0004h
LCDSE3_SEGEN28_POSITION                  equ 0004h
LCDSE3_SEGEN28_SIZE                      equ 0001h
LCDSE3_SEGEN28_LENGTH                    equ 0001h
LCDSE3_SEGEN28_MASK                      equ 0010h
LCDSE3_SEGEN29_POSN                      equ 0005h
LCDSE3_SEGEN29_POSITION                  equ 0005h
LCDSE3_SEGEN29_SIZE                      equ 0001h
LCDSE3_SEGEN29_LENGTH                    equ 0001h
LCDSE3_SEGEN29_MASK                      equ 0020h
LCDSE3_SEGEN30_POSN                      equ 0006h
LCDSE3_SEGEN30_POSITION                  equ 0006h
LCDSE3_SEGEN30_SIZE                      equ 0001h
LCDSE3_SEGEN30_LENGTH                    equ 0001h
LCDSE3_SEGEN30_MASK                      equ 0040h
LCDSE3_SEGEN31_POSN                      equ 0007h
LCDSE3_SEGEN31_POSITION                  equ 0007h
LCDSE3_SEGEN31_SIZE                      equ 0001h
LCDSE3_SEGEN31_LENGTH                    equ 0001h
LCDSE3_SEGEN31_MASK                      equ 0080h

// Register: LCDDATA0
#define LCDDATA0 LCDDATA0
LCDDATA0                                 equ 0F60h
// bitfield definitions
LCDDATA0_LCDDATA0_POSN                   equ 0000h
LCDDATA0_LCDDATA0_POSITION               equ 0000h
LCDDATA0_LCDDATA0_SIZE                   equ 0008h
LCDDATA0_LCDDATA0_LENGTH                 equ 0008h
LCDDATA0_LCDDATA0_MASK                   equ 00FFh
LCDDATA0_S0C0_POSN                       equ 0000h
LCDDATA0_S0C0_POSITION                   equ 0000h
LCDDATA0_S0C0_SIZE                       equ 0001h
LCDDATA0_S0C0_LENGTH                     equ 0001h
LCDDATA0_S0C0_MASK                       equ 0001h
LCDDATA0_S1C0_POSN                       equ 0001h
LCDDATA0_S1C0_POSITION                   equ 0001h
LCDDATA0_S1C0_SIZE                       equ 0001h
LCDDATA0_S1C0_LENGTH                     equ 0001h
LCDDATA0_S1C0_MASK                       equ 0002h
LCDDATA0_S2C0_POSN                       equ 0002h
LCDDATA0_S2C0_POSITION                   equ 0002h
LCDDATA0_S2C0_SIZE                       equ 0001h
LCDDATA0_S2C0_LENGTH                     equ 0001h
LCDDATA0_S2C0_MASK                       equ 0004h
LCDDATA0_S3C0_POSN                       equ 0003h
LCDDATA0_S3C0_POSITION                   equ 0003h
LCDDATA0_S3C0_SIZE                       equ 0001h
LCDDATA0_S3C0_LENGTH                     equ 0001h
LCDDATA0_S3C0_MASK                       equ 0008h
LCDDATA0_S4C0_POSN                       equ 0004h
LCDDATA0_S4C0_POSITION                   equ 0004h
LCDDATA0_S4C0_SIZE                       equ 0001h
LCDDATA0_S4C0_LENGTH                     equ 0001h
LCDDATA0_S4C0_MASK                       equ 0010h
LCDDATA0_S5C0_POSN                       equ 0005h
LCDDATA0_S5C0_POSITION                   equ 0005h
LCDDATA0_S5C0_SIZE                       equ 0001h
LCDDATA0_S5C0_LENGTH                     equ 0001h
LCDDATA0_S5C0_MASK                       equ 0020h
LCDDATA0_S6C0_POSN                       equ 0006h
LCDDATA0_S6C0_POSITION                   equ 0006h
LCDDATA0_S6C0_SIZE                       equ 0001h
LCDDATA0_S6C0_LENGTH                     equ 0001h
LCDDATA0_S6C0_MASK                       equ 0040h
LCDDATA0_S7C0_POSN                       equ 0007h
LCDDATA0_S7C0_POSITION                   equ 0007h
LCDDATA0_S7C0_SIZE                       equ 0001h
LCDDATA0_S7C0_LENGTH                     equ 0001h
LCDDATA0_S7C0_MASK                       equ 0080h
LCDDATA0_SEG0COM0_POSN                   equ 0000h
LCDDATA0_SEG0COM0_POSITION               equ 0000h
LCDDATA0_SEG0COM0_SIZE                   equ 0001h
LCDDATA0_SEG0COM0_LENGTH                 equ 0001h
LCDDATA0_SEG0COM0_MASK                   equ 0001h
LCDDATA0_SEG1COM0_POSN                   equ 0001h
LCDDATA0_SEG1COM0_POSITION               equ 0001h
LCDDATA0_SEG1COM0_SIZE                   equ 0001h
LCDDATA0_SEG1COM0_LENGTH                 equ 0001h
LCDDATA0_SEG1COM0_MASK                   equ 0002h
LCDDATA0_SEG2COM0_POSN                   equ 0002h
LCDDATA0_SEG2COM0_POSITION               equ 0002h
LCDDATA0_SEG2COM0_SIZE                   equ 0001h
LCDDATA0_SEG2COM0_LENGTH                 equ 0001h
LCDDATA0_SEG2COM0_MASK                   equ 0004h
LCDDATA0_SEG3COM0_POSN                   equ 0003h
LCDDATA0_SEG3COM0_POSITION               equ 0003h
LCDDATA0_SEG3COM0_SIZE                   equ 0001h
LCDDATA0_SEG3COM0_LENGTH                 equ 0001h
LCDDATA0_SEG3COM0_MASK                   equ 0008h
LCDDATA0_SEG4COM0_POSN                   equ 0004h
LCDDATA0_SEG4COM0_POSITION               equ 0004h
LCDDATA0_SEG4COM0_SIZE                   equ 0001h
LCDDATA0_SEG4COM0_LENGTH                 equ 0001h
LCDDATA0_SEG4COM0_MASK                   equ 0010h
LCDDATA0_SEG5COM0_POSN                   equ 0005h
LCDDATA0_SEG5COM0_POSITION               equ 0005h
LCDDATA0_SEG5COM0_SIZE                   equ 0001h
LCDDATA0_SEG5COM0_LENGTH                 equ 0001h
LCDDATA0_SEG5COM0_MASK                   equ 0020h
LCDDATA0_SEG6COM0_POSN                   equ 0006h
LCDDATA0_SEG6COM0_POSITION               equ 0006h
LCDDATA0_SEG6COM0_SIZE                   equ 0001h
LCDDATA0_SEG6COM0_LENGTH                 equ 0001h
LCDDATA0_SEG6COM0_MASK                   equ 0040h
LCDDATA0_SEG7COM0_POSN                   equ 0007h
LCDDATA0_SEG7COM0_POSITION               equ 0007h
LCDDATA0_SEG7COM0_SIZE                   equ 0001h
LCDDATA0_SEG7COM0_LENGTH                 equ 0001h
LCDDATA0_SEG7COM0_MASK                   equ 0080h
LCDDATA0_S00C0_POSN                      equ 0000h
LCDDATA0_S00C0_POSITION                  equ 0000h
LCDDATA0_S00C0_SIZE                      equ 0001h
LCDDATA0_S00C0_LENGTH                    equ 0001h
LCDDATA0_S00C0_MASK                      equ 0001h
LCDDATA0_S01C0_POSN                      equ 0001h
LCDDATA0_S01C0_POSITION                  equ 0001h
LCDDATA0_S01C0_SIZE                      equ 0001h
LCDDATA0_S01C0_LENGTH                    equ 0001h
LCDDATA0_S01C0_MASK                      equ 0002h
LCDDATA0_S02C0_POSN                      equ 0002h
LCDDATA0_S02C0_POSITION                  equ 0002h
LCDDATA0_S02C0_SIZE                      equ 0001h
LCDDATA0_S02C0_LENGTH                    equ 0001h
LCDDATA0_S02C0_MASK                      equ 0004h
LCDDATA0_S03C0_POSN                      equ 0003h
LCDDATA0_S03C0_POSITION                  equ 0003h
LCDDATA0_S03C0_SIZE                      equ 0001h
LCDDATA0_S03C0_LENGTH                    equ 0001h
LCDDATA0_S03C0_MASK                      equ 0008h
LCDDATA0_S04C0_POSN                      equ 0004h
LCDDATA0_S04C0_POSITION                  equ 0004h
LCDDATA0_S04C0_SIZE                      equ 0001h
LCDDATA0_S04C0_LENGTH                    equ 0001h
LCDDATA0_S04C0_MASK                      equ 0010h
LCDDATA0_S05C0_POSN                      equ 0005h
LCDDATA0_S05C0_POSITION                  equ 0005h
LCDDATA0_S05C0_SIZE                      equ 0001h
LCDDATA0_S05C0_LENGTH                    equ 0001h
LCDDATA0_S05C0_MASK                      equ 0020h
LCDDATA0_S06C0_POSN                      equ 0006h
LCDDATA0_S06C0_POSITION                  equ 0006h
LCDDATA0_S06C0_SIZE                      equ 0001h
LCDDATA0_S06C0_LENGTH                    equ 0001h
LCDDATA0_S06C0_MASK                      equ 0040h
LCDDATA0_S07C0_POSN                      equ 0007h
LCDDATA0_S07C0_POSITION                  equ 0007h
LCDDATA0_S07C0_SIZE                      equ 0001h
LCDDATA0_S07C0_LENGTH                    equ 0001h
LCDDATA0_S07C0_MASK                      equ 0080h

// Register: LCDDATA1
#define LCDDATA1 LCDDATA1
LCDDATA1                                 equ 0F61h
// bitfield definitions
LCDDATA1_LCDDATA1_POSN                   equ 0000h
LCDDATA1_LCDDATA1_POSITION               equ 0000h
LCDDATA1_LCDDATA1_SIZE                   equ 0008h
LCDDATA1_LCDDATA1_LENGTH                 equ 0008h
LCDDATA1_LCDDATA1_MASK                   equ 00FFh
LCDDATA1_S8C0_POSN                       equ 0000h
LCDDATA1_S8C0_POSITION                   equ 0000h
LCDDATA1_S8C0_SIZE                       equ 0001h
LCDDATA1_S8C0_LENGTH                     equ 0001h
LCDDATA1_S8C0_MASK                       equ 0001h
LCDDATA1_S9C0_POSN                       equ 0001h
LCDDATA1_S9C0_POSITION                   equ 0001h
LCDDATA1_S9C0_SIZE                       equ 0001h
LCDDATA1_S9C0_LENGTH                     equ 0001h
LCDDATA1_S9C0_MASK                       equ 0002h
LCDDATA1_S10C0_POSN                      equ 0002h
LCDDATA1_S10C0_POSITION                  equ 0002h
LCDDATA1_S10C0_SIZE                      equ 0001h
LCDDATA1_S10C0_LENGTH                    equ 0001h
LCDDATA1_S10C0_MASK                      equ 0004h
LCDDATA1_S11C0_POSN                      equ 0003h
LCDDATA1_S11C0_POSITION                  equ 0003h
LCDDATA1_S11C0_SIZE                      equ 0001h
LCDDATA1_S11C0_LENGTH                    equ 0001h
LCDDATA1_S11C0_MASK                      equ 0008h
LCDDATA1_S12C0_POSN                      equ 0004h
LCDDATA1_S12C0_POSITION                  equ 0004h
LCDDATA1_S12C0_SIZE                      equ 0001h
LCDDATA1_S12C0_LENGTH                    equ 0001h
LCDDATA1_S12C0_MASK                      equ 0010h
LCDDATA1_S13C0_POSN                      equ 0005h
LCDDATA1_S13C0_POSITION                  equ 0005h
LCDDATA1_S13C0_SIZE                      equ 0001h
LCDDATA1_S13C0_LENGTH                    equ 0001h
LCDDATA1_S13C0_MASK                      equ 0020h
LCDDATA1_S14C0_POSN                      equ 0006h
LCDDATA1_S14C0_POSITION                  equ 0006h
LCDDATA1_S14C0_SIZE                      equ 0001h
LCDDATA1_S14C0_LENGTH                    equ 0001h
LCDDATA1_S14C0_MASK                      equ 0040h
LCDDATA1_S15C0_POSN                      equ 0007h
LCDDATA1_S15C0_POSITION                  equ 0007h
LCDDATA1_S15C0_SIZE                      equ 0001h
LCDDATA1_S15C0_LENGTH                    equ 0001h
LCDDATA1_S15C0_MASK                      equ 0080h
LCDDATA1_SEG8COM0_POSN                   equ 0000h
LCDDATA1_SEG8COM0_POSITION               equ 0000h
LCDDATA1_SEG8COM0_SIZE                   equ 0001h
LCDDATA1_SEG8COM0_LENGTH                 equ 0001h
LCDDATA1_SEG8COM0_MASK                   equ 0001h
LCDDATA1_SEG9COM0_POSN                   equ 0001h
LCDDATA1_SEG9COM0_POSITION               equ 0001h
LCDDATA1_SEG9COM0_SIZE                   equ 0001h
LCDDATA1_SEG9COM0_LENGTH                 equ 0001h
LCDDATA1_SEG9COM0_MASK                   equ 0002h
LCDDATA1_SEG10COM0_POSN                  equ 0002h
LCDDATA1_SEG10COM0_POSITION              equ 0002h
LCDDATA1_SEG10COM0_SIZE                  equ 0001h
LCDDATA1_SEG10COM0_LENGTH                equ 0001h
LCDDATA1_SEG10COM0_MASK                  equ 0004h
LCDDATA1_SEG11COM0_POSN                  equ 0003h
LCDDATA1_SEG11COM0_POSITION              equ 0003h
LCDDATA1_SEG11COM0_SIZE                  equ 0001h
LCDDATA1_SEG11COM0_LENGTH                equ 0001h
LCDDATA1_SEG11COM0_MASK                  equ 0008h
LCDDATA1_SEG12COM0_POSN                  equ 0004h
LCDDATA1_SEG12COM0_POSITION              equ 0004h
LCDDATA1_SEG12COM0_SIZE                  equ 0001h
LCDDATA1_SEG12COM0_LENGTH                equ 0001h
LCDDATA1_SEG12COM0_MASK                  equ 0010h
LCDDATA1_SEG13COM0_POSN                  equ 0005h
LCDDATA1_SEG13COM0_POSITION              equ 0005h
LCDDATA1_SEG13COM0_SIZE                  equ 0001h
LCDDATA1_SEG13COM0_LENGTH                equ 0001h
LCDDATA1_SEG13COM0_MASK                  equ 0020h
LCDDATA1_SEG14COM0_POSN                  equ 0006h
LCDDATA1_SEG14COM0_POSITION              equ 0006h
LCDDATA1_SEG14COM0_SIZE                  equ 0001h
LCDDATA1_SEG14COM0_LENGTH                equ 0001h
LCDDATA1_SEG14COM0_MASK                  equ 0040h
LCDDATA1_SEG15COM0_POSN                  equ 0007h
LCDDATA1_SEG15COM0_POSITION              equ 0007h
LCDDATA1_SEG15COM0_SIZE                  equ 0001h
LCDDATA1_SEG15COM0_LENGTH                equ 0001h
LCDDATA1_SEG15COM0_MASK                  equ 0080h
LCDDATA1_S08C0_POSN                      equ 0000h
LCDDATA1_S08C0_POSITION                  equ 0000h
LCDDATA1_S08C0_SIZE                      equ 0001h
LCDDATA1_S08C0_LENGTH                    equ 0001h
LCDDATA1_S08C0_MASK                      equ 0001h
LCDDATA1_S09C0_POSN                      equ 0001h
LCDDATA1_S09C0_POSITION                  equ 0001h
LCDDATA1_S09C0_SIZE                      equ 0001h
LCDDATA1_S09C0_LENGTH                    equ 0001h
LCDDATA1_S09C0_MASK                      equ 0002h

// Register: LCDDATA2
#define LCDDATA2 LCDDATA2
LCDDATA2                                 equ 0F62h
// bitfield definitions
LCDDATA2_LCDDATA2_POSN                   equ 0000h
LCDDATA2_LCDDATA2_POSITION               equ 0000h
LCDDATA2_LCDDATA2_SIZE                   equ 0008h
LCDDATA2_LCDDATA2_LENGTH                 equ 0008h
LCDDATA2_LCDDATA2_MASK                   equ 00FFh
LCDDATA2_S16C0_POSN                      equ 0000h
LCDDATA2_S16C0_POSITION                  equ 0000h
LCDDATA2_S16C0_SIZE                      equ 0001h
LCDDATA2_S16C0_LENGTH                    equ 0001h
LCDDATA2_S16C0_MASK                      equ 0001h
LCDDATA2_S17C0_POSN                      equ 0001h
LCDDATA2_S17C0_POSITION                  equ 0001h
LCDDATA2_S17C0_SIZE                      equ 0001h
LCDDATA2_S17C0_LENGTH                    equ 0001h
LCDDATA2_S17C0_MASK                      equ 0002h
LCDDATA2_S18C0_POSN                      equ 0002h
LCDDATA2_S18C0_POSITION                  equ 0002h
LCDDATA2_S18C0_SIZE                      equ 0001h
LCDDATA2_S18C0_LENGTH                    equ 0001h
LCDDATA2_S18C0_MASK                      equ 0004h
LCDDATA2_S19C0_POSN                      equ 0003h
LCDDATA2_S19C0_POSITION                  equ 0003h
LCDDATA2_S19C0_SIZE                      equ 0001h
LCDDATA2_S19C0_LENGTH                    equ 0001h
LCDDATA2_S19C0_MASK                      equ 0008h
LCDDATA2_S20C0_POSN                      equ 0004h
LCDDATA2_S20C0_POSITION                  equ 0004h
LCDDATA2_S20C0_SIZE                      equ 0001h
LCDDATA2_S20C0_LENGTH                    equ 0001h
LCDDATA2_S20C0_MASK                      equ 0010h
LCDDATA2_S21C0_POSN                      equ 0005h
LCDDATA2_S21C0_POSITION                  equ 0005h
LCDDATA2_S21C0_SIZE                      equ 0001h
LCDDATA2_S21C0_LENGTH                    equ 0001h
LCDDATA2_S21C0_MASK                      equ 0020h
LCDDATA2_S22C0_POSN                      equ 0006h
LCDDATA2_S22C0_POSITION                  equ 0006h
LCDDATA2_S22C0_SIZE                      equ 0001h
LCDDATA2_S22C0_LENGTH                    equ 0001h
LCDDATA2_S22C0_MASK                      equ 0040h
LCDDATA2_S23C0_POSN                      equ 0007h
LCDDATA2_S23C0_POSITION                  equ 0007h
LCDDATA2_S23C0_SIZE                      equ 0001h
LCDDATA2_S23C0_LENGTH                    equ 0001h
LCDDATA2_S23C0_MASK                      equ 0080h
LCDDATA2_SEG16COM0_POSN                  equ 0000h
LCDDATA2_SEG16COM0_POSITION              equ 0000h
LCDDATA2_SEG16COM0_SIZE                  equ 0001h
LCDDATA2_SEG16COM0_LENGTH                equ 0001h
LCDDATA2_SEG16COM0_MASK                  equ 0001h
LCDDATA2_SEG17COM0_POSN                  equ 0001h
LCDDATA2_SEG17COM0_POSITION              equ 0001h
LCDDATA2_SEG17COM0_SIZE                  equ 0001h
LCDDATA2_SEG17COM0_LENGTH                equ 0001h
LCDDATA2_SEG17COM0_MASK                  equ 0002h
LCDDATA2_SEG18COM0_POSN                  equ 0002h
LCDDATA2_SEG18COM0_POSITION              equ 0002h
LCDDATA2_SEG18COM0_SIZE                  equ 0001h
LCDDATA2_SEG18COM0_LENGTH                equ 0001h
LCDDATA2_SEG18COM0_MASK                  equ 0004h
LCDDATA2_SEG19COM0_POSN                  equ 0003h
LCDDATA2_SEG19COM0_POSITION              equ 0003h
LCDDATA2_SEG19COM0_SIZE                  equ 0001h
LCDDATA2_SEG19COM0_LENGTH                equ 0001h
LCDDATA2_SEG19COM0_MASK                  equ 0008h
LCDDATA2_SEG20COM0_POSN                  equ 0004h
LCDDATA2_SEG20COM0_POSITION              equ 0004h
LCDDATA2_SEG20COM0_SIZE                  equ 0001h
LCDDATA2_SEG20COM0_LENGTH                equ 0001h
LCDDATA2_SEG20COM0_MASK                  equ 0010h
LCDDATA2_SEG21COM0_POSN                  equ 0005h
LCDDATA2_SEG21COM0_POSITION              equ 0005h
LCDDATA2_SEG21COM0_SIZE                  equ 0001h
LCDDATA2_SEG21COM0_LENGTH                equ 0001h
LCDDATA2_SEG21COM0_MASK                  equ 0020h
LCDDATA2_SEG22COM0_POSN                  equ 0006h
LCDDATA2_SEG22COM0_POSITION              equ 0006h
LCDDATA2_SEG22COM0_SIZE                  equ 0001h
LCDDATA2_SEG22COM0_LENGTH                equ 0001h
LCDDATA2_SEG22COM0_MASK                  equ 0040h
LCDDATA2_SEG23COM0_POSN                  equ 0007h
LCDDATA2_SEG23COM0_POSITION              equ 0007h
LCDDATA2_SEG23COM0_SIZE                  equ 0001h
LCDDATA2_SEG23COM0_LENGTH                equ 0001h
LCDDATA2_SEG23COM0_MASK                  equ 0080h

