GopalSaraf/Practicals/PSDL/include/proc/pic18f6393.inc
// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
LCDDATA22                                equ 0F7Bh
// bitfield definitions
LCDDATA22_LCDDATA22_POSN                 equ 0000h
LCDDATA22_LCDDATA22_POSITION             equ 0000h
LCDDATA22_LCDDATA22_SIZE                 equ 0008h
LCDDATA22_LCDDATA22_LENGTH               equ 0008h
LCDDATA22_LCDDATA22_MASK                 equ 00FFh
LCDDATA22_S32C3_POSN                     equ 0000h
LCDDATA22_S32C3_POSITION                 equ 0000h
LCDDATA22_S32C3_SIZE                     equ 0001h
LCDDATA22_S32C3_LENGTH                   equ 0001h
LCDDATA22_S32C3_MASK                     equ 0001h
LCDDATA22_S33C3_POSN                     equ 0001h
LCDDATA22_S33C3_POSITION                 equ 0001h
LCDDATA22_S33C3_SIZE                     equ 0001h
LCDDATA22_S33C3_LENGTH                   equ 0001h
LCDDATA22_S33C3_MASK                     equ 0002h
LCDDATA22_S34C3_POSN                     equ 0002h
LCDDATA22_S34C3_POSITION                 equ 0002h
LCDDATA22_S34C3_SIZE                     equ 0001h
LCDDATA22_S34C3_LENGTH                   equ 0001h
LCDDATA22_S34C3_MASK                     equ 0004h
LCDDATA22_S35C3_POSN                     equ 0003h
LCDDATA22_S35C3_POSITION                 equ 0003h
LCDDATA22_S35C3_SIZE                     equ 0001h
LCDDATA22_S35C3_LENGTH                   equ 0001h
LCDDATA22_S35C3_MASK                     equ 0008h
LCDDATA22_S36C3_POSN                     equ 0004h
LCDDATA22_S36C3_POSITION                 equ 0004h
LCDDATA22_S36C3_SIZE                     equ 0001h
LCDDATA22_S36C3_LENGTH                   equ 0001h
LCDDATA22_S36C3_MASK                     equ 0010h
LCDDATA22_S37C3_POSN                     equ 0005h
LCDDATA22_S37C3_POSITION                 equ 0005h
LCDDATA22_S37C3_SIZE                     equ 0001h
LCDDATA22_S37C3_LENGTH                   equ 0001h
LCDDATA22_S37C3_MASK                     equ 0020h
LCDDATA22_S38C3_POSN                     equ 0006h
LCDDATA22_S38C3_POSITION                 equ 0006h
LCDDATA22_S38C3_SIZE                     equ 0001h
LCDDATA22_S38C3_LENGTH                   equ 0001h
LCDDATA22_S38C3_MASK                     equ 0040h
LCDDATA22_S39C3_POSN                     equ 0007h
LCDDATA22_S39C3_POSITION                 equ 0007h
LCDDATA22_S39C3_SIZE                     equ 0001h
LCDDATA22_S39C3_LENGTH                   equ 0001h
LCDDATA22_S39C3_MASK                     equ 0080h
LCDDATA22_SEG32COM3_POSN                 equ 0000h
LCDDATA22_SEG32COM3_POSITION             equ 0000h
LCDDATA22_SEG32COM3_SIZE                 equ 0001h
LCDDATA22_SEG32COM3_LENGTH               equ 0001h
LCDDATA22_SEG32COM3_MASK                 equ 0001h
LCDDATA22_SEG33COM3_POSN                 equ 0001h
LCDDATA22_SEG33COM3_POSITION             equ 0001h
LCDDATA22_SEG33COM3_SIZE                 equ 0001h
LCDDATA22_SEG33COM3_LENGTH               equ 0001h
LCDDATA22_SEG33COM3_MASK                 equ 0002h
LCDDATA22_SEG34COM3_POSN                 equ 0002h
LCDDATA22_SEG34COM3_POSITION             equ 0002h
LCDDATA22_SEG34COM3_SIZE                 equ 0001h
LCDDATA22_SEG34COM3_LENGTH               equ 0001h
LCDDATA22_SEG34COM3_MASK                 equ 0004h
LCDDATA22_SEG35COM3_POSN                 equ 0003h
LCDDATA22_SEG35COM3_POSITION             equ 0003h
LCDDATA22_SEG35COM3_SIZE                 equ 0001h
LCDDATA22_SEG35COM3_LENGTH               equ 0001h
LCDDATA22_SEG35COM3_MASK                 equ 0008h
LCDDATA22_SEG36COM3_POSN                 equ 0004h
LCDDATA22_SEG36COM3_POSITION             equ 0004h
LCDDATA22_SEG36COM3_SIZE                 equ 0001h
LCDDATA22_SEG36COM3_LENGTH               equ 0001h
LCDDATA22_SEG36COM3_MASK                 equ 0010h
LCDDATA22_SEG37COM3_POSN                 equ 0005h
LCDDATA22_SEG37COM3_POSITION             equ 0005h
LCDDATA22_SEG37COM3_SIZE                 equ 0001h
LCDDATA22_SEG37COM3_LENGTH               equ 0001h
LCDDATA22_SEG37COM3_MASK                 equ 0020h
LCDDATA22_SEG38COM3_POSN                 equ 0006h
LCDDATA22_SEG38COM3_POSITION             equ 0006h
LCDDATA22_SEG38COM3_SIZE                 equ 0001h
LCDDATA22_SEG38COM3_LENGTH               equ 0001h
LCDDATA22_SEG38COM3_MASK                 equ 0040h
LCDDATA22_SEG39COM3_POSN                 equ 0007h
LCDDATA22_SEG39COM3_POSITION             equ 0007h
LCDDATA22_SEG39COM3_SIZE                 equ 0001h
LCDDATA22_SEG39COM3_LENGTH               equ 0001h
LCDDATA22_SEG39COM3_MASK                 equ 0080h

// Register: LCDDATA23
#define LCDDATA23 LCDDATA23
LCDDATA23                                equ 0F7Ch
// bitfield definitions
LCDDATA23_LCDDATA23_POSN                 equ 0000h
LCDDATA23_LCDDATA23_POSITION             equ 0000h
LCDDATA23_LCDDATA23_SIZE                 equ 0008h
LCDDATA23_LCDDATA23_LENGTH               equ 0008h
LCDDATA23_LCDDATA23_MASK                 equ 00FFh
LCDDATA23_S40C3_POSN                     equ 0000h
LCDDATA23_S40C3_POSITION                 equ 0000h
LCDDATA23_S40C3_SIZE                     equ 0001h
LCDDATA23_S40C3_LENGTH                   equ 0001h
LCDDATA23_S40C3_MASK                     equ 0001h
LCDDATA23_S41C3_POSN                     equ 0001h
LCDDATA23_S41C3_POSITION                 equ 0001h
LCDDATA23_S41C3_SIZE                     equ 0001h
LCDDATA23_S41C3_LENGTH                   equ 0001h
LCDDATA23_S41C3_MASK                     equ 0002h
LCDDATA23_S42C3_POSN                     equ 0002h
LCDDATA23_S42C3_POSITION                 equ 0002h
LCDDATA23_S42C3_SIZE                     equ 0001h
LCDDATA23_S42C3_LENGTH                   equ 0001h
LCDDATA23_S42C3_MASK                     equ 0004h
LCDDATA23_S43C3_POSN                     equ 0003h
LCDDATA23_S43C3_POSITION                 equ 0003h
LCDDATA23_S43C3_SIZE                     equ 0001h
LCDDATA23_S43C3_LENGTH                   equ 0001h
LCDDATA23_S43C3_MASK                     equ 0008h
LCDDATA23_S44C3_POSN                     equ 0004h
LCDDATA23_S44C3_POSITION                 equ 0004h
LCDDATA23_S44C3_SIZE                     equ 0001h
LCDDATA23_S44C3_LENGTH                   equ 0001h
LCDDATA23_S44C3_MASK                     equ 0010h
LCDDATA23_S45C3_POSN                     equ 0005h
LCDDATA23_S45C3_POSITION                 equ 0005h
LCDDATA23_S45C3_SIZE                     equ 0001h
LCDDATA23_S45C3_LENGTH                   equ 0001h
LCDDATA23_S45C3_MASK                     equ 0020h
LCDDATA23_S46C3_POSN                     equ 0006h
LCDDATA23_S46C3_POSITION                 equ 0006h
LCDDATA23_S46C3_SIZE                     equ 0001h
LCDDATA23_S46C3_LENGTH                   equ 0001h
LCDDATA23_S46C3_MASK                     equ 0040h
LCDDATA23_S47C3_POSN                     equ 0007h
LCDDATA23_S47C3_POSITION                 equ 0007h
LCDDATA23_S47C3_SIZE                     equ 0001h
LCDDATA23_S47C3_LENGTH                   equ 0001h
LCDDATA23_S47C3_MASK                     equ 0080h
LCDDATA23_SEG40COM3_POSN                 equ 0000h
LCDDATA23_SEG40COM3_POSITION             equ 0000h
LCDDATA23_SEG40COM3_SIZE                 equ 0001h
LCDDATA23_SEG40COM3_LENGTH               equ 0001h
LCDDATA23_SEG40COM3_MASK                 equ 0001h
LCDDATA23_SEG41COM3_POSN                 equ 0001h
LCDDATA23_SEG41COM3_POSITION             equ 0001h
LCDDATA23_SEG41COM3_SIZE                 equ 0001h
LCDDATA23_SEG41COM3_LENGTH               equ 0001h
LCDDATA23_SEG41COM3_MASK                 equ 0002h
LCDDATA23_SEG42COM3_POSN                 equ 0002h
LCDDATA23_SEG42COM3_POSITION             equ 0002h
LCDDATA23_SEG42COM3_SIZE                 equ 0001h
LCDDATA23_SEG42COM3_LENGTH               equ 0001h
LCDDATA23_SEG42COM3_MASK                 equ 0004h
LCDDATA23_SEG43COM3_POSN                 equ 0003h
LCDDATA23_SEG43COM3_POSITION             equ 0003h
LCDDATA23_SEG43COM3_SIZE                 equ 0001h
LCDDATA23_SEG43COM3_LENGTH               equ 0001h
LCDDATA23_SEG43COM3_MASK                 equ 0008h
LCDDATA23_SEG44COM3_POSN                 equ 0004h
LCDDATA23_SEG44COM3_POSITION             equ 0004h
LCDDATA23_SEG44COM3_SIZE                 equ 0001h
LCDDATA23_SEG44COM3_LENGTH               equ 0001h
LCDDATA23_SEG44COM3_MASK                 equ 0010h
LCDDATA23_SEG45COM3_POSN                 equ 0005h
LCDDATA23_SEG45COM3_POSITION             equ 0005h
LCDDATA23_SEG45COM3_SIZE                 equ 0001h
LCDDATA23_SEG45COM3_LENGTH               equ 0001h
LCDDATA23_SEG45COM3_MASK                 equ 0020h
LCDDATA23_SEG46COM3_POSN                 equ 0006h
LCDDATA23_SEG46COM3_POSITION             equ 0006h
LCDDATA23_SEG46COM3_SIZE                 equ 0001h
LCDDATA23_SEG46COM3_LENGTH               equ 0001h
LCDDATA23_SEG46COM3_MASK                 equ 0040h
LCDDATA23_SEG47COM3_POSN                 equ 0007h
LCDDATA23_SEG47COM3_POSITION             equ 0007h
LCDDATA23_SEG47COM3_SIZE                 equ 0001h
LCDDATA23_SEG47COM3_LENGTH               equ 0001h
LCDDATA23_SEG47COM3_MASK                 equ 0080h

// Register: BAUDCON1
#define BAUDCON1 BAUDCON1
BAUDCON1                                 equ 0F7Eh
// bitfield definitions
BAUDCON1_ABDEN_POSN                      equ 0000h
BAUDCON1_ABDEN_POSITION                  equ 0000h
BAUDCON1_ABDEN_SIZE                      equ 0001h
BAUDCON1_ABDEN_LENGTH                    equ 0001h
BAUDCON1_ABDEN_MASK                      equ 0001h
BAUDCON1_WUE_POSN                        equ 0001h
BAUDCON1_WUE_POSITION                    equ 0001h
BAUDCON1_WUE_SIZE                        equ 0001h
BAUDCON1_WUE_LENGTH                      equ 0001h
BAUDCON1_WUE_MASK                        equ 0002h
BAUDCON1_BRG16_POSN                      equ 0003h
BAUDCON1_BRG16_POSITION                  equ 0003h
BAUDCON1_BRG16_SIZE                      equ 0001h
BAUDCON1_BRG16_LENGTH                    equ 0001h
BAUDCON1_BRG16_MASK                      equ 0008h
BAUDCON1_SCKP_POSN                       equ 0004h
BAUDCON1_SCKP_POSITION                   equ 0004h
BAUDCON1_SCKP_SIZE                       equ 0001h
BAUDCON1_SCKP_LENGTH                     equ 0001h
BAUDCON1_SCKP_MASK                       equ 0010h
BAUDCON1_RCIDL_POSN                      equ 0006h
BAUDCON1_RCIDL_POSITION                  equ 0006h
BAUDCON1_RCIDL_SIZE                      equ 0001h
BAUDCON1_RCIDL_LENGTH                    equ 0001h
BAUDCON1_RCIDL_MASK                      equ 0040h
BAUDCON1_ABDOVF_POSN                     equ 0007h
BAUDCON1_ABDOVF_POSITION                 equ 0007h
BAUDCON1_ABDOVF_SIZE                     equ 0001h
BAUDCON1_ABDOVF_LENGTH                   equ 0001h
BAUDCON1_ABDOVF_MASK                     equ 0080h
BAUDCON1_RCMT_POSN                       equ 0006h
BAUDCON1_RCMT_POSITION                   equ 0006h
BAUDCON1_RCMT_SIZE                       equ 0001h
BAUDCON1_RCMT_LENGTH                     equ 0001h
BAUDCON1_RCMT_MASK                       equ 0040h
BAUDCON1_ABDEN1_POSN                     equ 0000h
BAUDCON1_ABDEN1_POSITION                 equ 0000h
BAUDCON1_ABDEN1_SIZE                     equ 0001h
BAUDCON1_ABDEN1_LENGTH                   equ 0001h
BAUDCON1_ABDEN1_MASK                     equ 0001h
BAUDCON1_WUE1_POSN                       equ 0001h
BAUDCON1_WUE1_POSITION                   equ 0001h
BAUDCON1_WUE1_SIZE                       equ 0001h
BAUDCON1_WUE1_LENGTH                     equ 0001h
BAUDCON1_WUE1_MASK                       equ 0002h
BAUDCON1_BRG161_POSN                     equ 0003h
BAUDCON1_BRG161_POSITION                 equ 0003h
BAUDCON1_BRG161_SIZE                     equ 0001h
BAUDCON1_BRG161_LENGTH                   equ 0001h
BAUDCON1_BRG161_MASK                     equ 0008h
BAUDCON1_CKTXP_POSN                      equ 0004h
BAUDCON1_CKTXP_POSITION                  equ 0004h
BAUDCON1_CKTXP_SIZE                      equ 0001h
BAUDCON1_CKTXP_LENGTH                    equ 0001h
BAUDCON1_CKTXP_MASK                      equ 0010h
BAUDCON1_RCIDL1_POSN                     equ 0006h
BAUDCON1_RCIDL1_POSITION                 equ 0006h
BAUDCON1_RCIDL1_SIZE                     equ 0001h
BAUDCON1_RCIDL1_LENGTH                   equ 0001h
BAUDCON1_RCIDL1_MASK                     equ 0040h
BAUDCON1_ABDOVF1_POSN                    equ 0007h
BAUDCON1_ABDOVF1_POSITION                equ 0007h
BAUDCON1_ABDOVF1_SIZE                    equ 0001h
BAUDCON1_ABDOVF1_LENGTH                  equ 0001h
BAUDCON1_ABDOVF1_MASK                    equ 0080h
BAUDCON1_SCKP1_POSN                      equ 0004h
BAUDCON1_SCKP1_POSITION                  equ 0004h
BAUDCON1_SCKP1_SIZE                      equ 0001h
BAUDCON1_SCKP1_LENGTH                    equ 0001h
BAUDCON1_SCKP1_MASK                      equ 0010h
BAUDCON1_RCMT1_POSN                      equ 0006h
BAUDCON1_RCMT1_POSITION                  equ 0006h
BAUDCON1_RCMT1_SIZE                      equ 0001h
BAUDCON1_RCMT1_LENGTH                    equ 0001h
BAUDCON1_RCMT1_MASK                      equ 0040h
BAUDCON1_TXCKP_POSN                      equ 0004h
BAUDCON1_TXCKP_POSITION                  equ 0004h
BAUDCON1_TXCKP_SIZE                      equ 0001h
BAUDCON1_TXCKP_LENGTH                    equ 0001h
BAUDCON1_TXCKP_MASK                      equ 0010h
BAUDCON1_TXCKP1_POSN                     equ 0004h
BAUDCON1_TXCKP1_POSITION                 equ 0004h
BAUDCON1_TXCKP1_SIZE                     equ 0001h
BAUDCON1_TXCKP1_LENGTH                   equ 0001h
BAUDCON1_TXCKP1_MASK                     equ 0010h

// Register: SPBRGH1
#define SPBRGH1 SPBRGH1
SPBRGH1                                  equ 0F7Fh

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 0F80h
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA2_POSN                           equ 0002h
PORTA_RA2_POSITION                       equ 0002h
PORTA_RA2_SIZE                           equ 0001h
PORTA_RA2_LENGTH                         equ 0001h
PORTA_RA2_MASK                           equ 0004h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA5_POSN                           equ 0005h
PORTA_RA5_POSITION                       equ 0005h
PORTA_RA5_SIZE                           equ 0001h
PORTA_RA5_LENGTH                         equ 0001h
PORTA_RA5_MASK                           equ 0020h
PORTA_RA6_POSN                           equ 0006h
PORTA_RA6_POSITION                       equ 0006h
PORTA_RA6_SIZE                           equ 0001h
PORTA_RA6_LENGTH                         equ 0001h
PORTA_RA6_MASK                           equ 0040h
PORTA_RA7_POSN                           equ 0007h
PORTA_RA7_POSITION                       equ 0007h
PORTA_RA7_SIZE                           equ 0001h
PORTA_RA7_LENGTH                         equ 0001h
PORTA_RA7_MASK                           equ 0080h
PORTA_AN0_POSN                           equ 0000h
PORTA_AN0_POSITION                       equ 0000h
PORTA_AN0_SIZE                           equ 0001h
PORTA_AN0_LENGTH                         equ 0001h
PORTA_AN0_MASK                           equ 0001h
PORTA_AN1_POSN                           equ 0001h
PORTA_AN1_POSITION                       equ 0001h
PORTA_AN1_SIZE                           equ 0001h
PORTA_AN1_LENGTH                         equ 0001h
PORTA_AN1_MASK                           equ 0002h
PORTA_AN2_POSN                           equ 0002h
PORTA_AN2_POSITION                       equ 0002h
PORTA_AN2_SIZE                           equ 0001h
PORTA_AN2_LENGTH                         equ 0001h
PORTA_AN2_MASK                           equ 0004h
PORTA_AN3_POSN                           equ 0003h
PORTA_AN3_POSITION                       equ 0003h
PORTA_AN3_SIZE                           equ 0001h
PORTA_AN3_LENGTH                         equ 0001h
PORTA_AN3_MASK                           equ 0008h
PORTA_T0CKI_POSN                         equ 0004h
PORTA_T0CKI_POSITION                     equ 0004h
PORTA_T0CKI_SIZE                         equ 0001h
PORTA_T0CKI_LENGTH                       equ 0001h
PORTA_T0CKI_MASK                         equ 0010h
PORTA_AN4_POSN                           equ 0005h
PORTA_AN4_POSITION                       equ 0005h
PORTA_AN4_SIZE                           equ 0001h
PORTA_AN4_LENGTH                         equ 0001h
PORTA_AN4_MASK                           equ 0020h
PORTA_OSC2_POSN                          equ 0006h
PORTA_OSC2_POSITION                      equ 0006h
PORTA_OSC2_SIZE                          equ 0001h
PORTA_OSC2_LENGTH                        equ 0001h
PORTA_OSC2_MASK                          equ 0040h
PORTA_OSC1_POSN                          equ 0007h
PORTA_OSC1_POSITION                      equ 0007h
PORTA_OSC1_SIZE                          equ 0001h
PORTA_OSC1_LENGTH                        equ 0001h
PORTA_OSC1_MASK                          equ 0080h
PORTA_VREFM_POSN                         equ 0002h
PORTA_VREFM_POSITION                     equ 0002h
PORTA_VREFM_SIZE                         equ 0001h
PORTA_VREFM_LENGTH                       equ 0001h
PORTA_VREFM_MASK                         equ 0004h
PORTA_VREFP_POSN                         equ 0003h
PORTA_VREFP_POSITION                     equ 0003h
PORTA_VREFP_SIZE                         equ 0001h
PORTA_VREFP_LENGTH                       equ 0001h
PORTA_VREFP_MASK                         equ 0008h
PORTA_LVDIN_POSN                         equ 0005h
PORTA_LVDIN_POSITION                     equ 0005h
PORTA_LVDIN_SIZE                         equ 0001h
PORTA_LVDIN_LENGTH                       equ 0001h
PORTA_LVDIN_MASK                         equ 0020h
PORTA_CLKO_POSN                          equ 0006h
PORTA_CLKO_POSITION                      equ 0006h
PORTA_CLKO_SIZE                          equ 0001h
PORTA_CLKO_LENGTH                        equ 0001h
PORTA_CLKO_MASK                          equ 0040h
PORTA_CLKI_POSN                          equ 0007h
PORTA_CLKI_POSITION                      equ 0007h
PORTA_CLKI_SIZE                          equ 0001h
PORTA_CLKI_LENGTH                        equ 0001h
PORTA_CLKI_MASK                          equ 0080h
PORTA_SEG16_POSN                         equ 0002h
PORTA_SEG16_POSITION                     equ 0002h
PORTA_SEG16_SIZE                         equ 0001h
PORTA_SEG16_LENGTH                       equ 0001h
PORTA_SEG16_MASK                         equ 0004h
PORTA_SEG17_POSN                         equ 0003h
PORTA_SEG17_POSITION                     equ 0003h
PORTA_SEG17_SIZE                         equ 0001h
PORTA_SEG17_LENGTH                       equ 0001h
PORTA_SEG17_MASK                         equ 0008h
PORTA_SEG14_POSN                         equ 0004h
PORTA_SEG14_POSITION                     equ 0004h
PORTA_SEG14_SIZE                         equ 0001h
PORTA_SEG14_LENGTH                       equ 0001h
PORTA_SEG14_MASK                         equ 0010h
PORTA_SEG15_POSN                         equ 0005h
PORTA_SEG15_POSITION                     equ 0005h
PORTA_SEG15_SIZE                         equ 0001h
PORTA_SEG15_LENGTH                       equ 0001h
PORTA_SEG15_MASK                         equ 0020h
PORTA_ULPWUIN_POSN                       equ 0000h
PORTA_ULPWUIN_POSITION                   equ 0000h
PORTA_ULPWUIN_SIZE                       equ 0001h
PORTA_ULPWUIN_LENGTH                     equ 0001h
PORTA_ULPWUIN_MASK                       equ 0001h
PORTA_RJPU_POSN                          equ 0007h
PORTA_RJPU_POSITION                      equ 0007h
PORTA_RJPU_SIZE                          equ 0001h
PORTA_RJPU_LENGTH                        equ 0001h
PORTA_RJPU_MASK                          equ 0080h

